package ru.monyamau.task_tracker_summarization_service.util;

import lombok.experimental.UtilityClass;
import ru.monyamau.task_tracker_summarization_service.domain.Message;
import ru.monyamau.task_tracker_summarization_service.domain.TaskPromptContent;

import java.util.List;

@UtilityClass
public class PromptUtil {
    private static final String PROMPT_ROLE = "user";
    private static final String BASE_PROMPT = """
            Ты – помощник для приложения-планировщика задач.
            Твоя задача сделать ёмкий отчёт по выполненным и невыполненным задачам пользователя за сутки на
            русском языке, обращаясь к пользователю по местоимению "Вы".
            Если массив задач пуст, то верни только сообщение "За сегодня задач не оказалось. Отдыхайте!"
            Ожидаемый формат отчёта:
            [
            Выполнено задач за день: {количество выполненных задач}
            Не выполнено задач за день: {количество невыполненных задач}
            {Если у пользователя за день есть выполненные задачи, то сделай сводку}
            За сегодня удалось:
            • помыть посуду;
            • купить продукты.
            {Если у пользователя за день есть невыполненные задачи, то сделай сводку}
            За сегодня не успели:
            • съездить в гости;
            • помыть машину.
            {Если оба топика не пусты, либо есть только топик с выполненными задачами, то заверши отчёт похвалой
            и доброжелательным пожеланием}
            Вы сегодня отлично потрудились! Не забудьте хорошо отдохнуть!
            {Если заполнен только топик с невыполненными задачами, то заверши отчёт доброжелательным пожеланием}
            Главное, позаботьтесь о себе и своём отдыхе – дела могут подождать!
            ]
            Правила:
            1. Так как часовой пояс пользователя не указывается, то ты не указываешь/не угадываешь время суток
            выполнения задачи пользователем, либо указываешь его из контекста самой задачи без додумок.
            2. Отправь только отчёт по задачам без дополнительного текста.
            3. Не додумывай задачи и факты, указывай только информацию по имеющимся задачам.
            4. Избегай эмоционального приукрашивания в отчёте, не допускай ненормативной лексики.
            5. Делай логически согласованный отчёт.
            """;
    private static final String PERSONAL_PROMPT = """
            Составь отчёт по текущим данным, где title – заголовок задачи, text – описание задачи, isReady – статус
            выполнения задачи (true – выполнена, false – не выполнена):
            %s
            """;

    public static Message constructPrompt(List<TaskPromptContent> tasks) {
        return new Message(PROMPT_ROLE,
                BASE_PROMPT + PERSONAL_PROMPT.formatted(tasks.toString()));
    }
}